/**
 * https://blog.csdn.net/dam454450872/article/details/80382545
 * 
 * 
 * 一. 对象的发布
 * 		“发布”一个对象是指: 使对象能够在当前作用域之外的代码中使用。
 * 
 * 		①将一个指向该对象的引用保存到其他代码可以访问的地方: 如将对象的引用保存到一个公有的静态变量中，可以使任何类和线程都能看到该对象;
 *
 *		②在某一个非私有的方法中返回该引用
 *
 *		③将引用传递到其他类的方法中
 *			解释一下“外部方法”，一个class  C，对于C来说，“外部方法”指行为并不完全由C来规定的方法，
 *			包括其他类中定义的方法以及类C中可以被改写的方法（既不是私有方法【private】也不是终结方法【final】）
 *		
 *		④发布一个内部类，内部类会自动持有其外部类的 this引用
 * 
 * 二.this引用逸出[都是在外部的构造函数中创建并且发布了内部类]
 *		this引用逸出是指对象还没有构造完成，this引用就被发布出去。会涉及到线程安全的问题，因为其他线程可能会通过这个逸出的引用访问到还未初始化完成的不完整对象，
 *		而其他对象可能访问到是初始化完成的对象，这就会出现不一致性。
 *		1)在构造函数中创建并且发布了内部类     [解决办法:  通过私有的构造器+公共的工程方法]
 *		2)在构造函数中创建并且启动了线程:  [构造函数内不启动线程,等构造函数构建完成之后,在启动线程]
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 */
/**
 * @author Administrator
 * @date   2019年4月1日
 */
package com.ben.java.core.thread.escape;