/**
 * https://blog.csdn.net/tfygg/article/details/51638933
 *
 * 监听器模式:
 *
 * 监听器模型涉及以下三个对象，模型图如下：
 *
 * （1）事件：用户对组件的一个操作，称之为一个事件;
 * （2）事件源：发生事件的组件就是事件源;
 * （3）事件监听器（处理器）：监听并负责处理事件的方法;
 *
 *
 *  执行顺序如下：
 *
 * 1、给事件源注册监听器
 * 2、组件接受外部作用，也就是事件被触发
 * 3、组件产生一个相应的事件对象，并把此对象传递给与之关联的事件处理器
 * 4、事件处理器启动，并执行相关的代码来处理该事件。
 *
 *
 *监听器模式：事件源注册监听器之后，当事件源触发事件，监听器就可以回调事件对象的方法；更形象地说，监听者模式是基于：
 * 注册-回调的事件/消息通知处理模式，就是被监控者将消息通知给所有监控者。 
 *
 * 1、注册监听器：事件源.setListener；
 * 2、回调：事件源实现onListener。
 *
 */
/**
 * @author ben xia
 * @email  keeping1990@126.com
 * @date   2019年05月19日下午3:57:50
 * @version 
 */
package com.ben.java.gof.behavioral_model.observer.listener;